## 1.6 Группировка и агрегация

In [2]:
import pandas as pd

data = pd.read_csv('StudentsPerformance.csv')
data.info()
rename_map = {'math score': 'math_score', 'reading score': 'reading_score', 'writing score': 'writing_score'}
data.rename(columns = rename_map, inplace=True)
data.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math_score,reading_score,writing_score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

groupby - группирует данные

In [11]:
rename_column_map = {'math_score': 'mean_math_score', 'reading_score': 'mean_reading_score', 'writing_score': 'sum_writing_score'}
data.groupby('gender', as_index=False).aggregate({'math_score': 'mean', 'reading_score': 'mean', 'writing_score': 'sum'}).rename(columns=rename_column_map)

   gender  mean_math_score  mean_reading_score  sum_writing_score
0  female        63.633205           72.608108              37538
1    male        68.728216           65.473029              30516

In [5]:
dota2_stats = pd.read_csv('data/dota_hero_stats.csv')
dota2_stats.info()
dota2_stats.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 117 entries, 0 to 116
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Unnamed: 0      117 non-null    int64
 1   attack_type     117 non-null    object
 2   id              117 non-null    int64
 3   legs            117 non-null    int64
 4   localized_name  117 non-null    object
 5   name            117 non-null    object
 6   primary_attr    117 non-null    object
 7   roles           117 non-null    object
dtypes: int64(3), object(5)
memory usage: 7.4+ KB

,Unnamed: 0,attack_type,id,legs,localized_name,name,primary_attr,roles
0,0,Melee,1,2,Anti-Mage,npc_dota_hero_antimage,agi,"['Carry', 'Escape', 'Nuker']"
1,1,Melee,2,2,Axe,npc_dota_hero_axe,str,"['Initiator', 'Durable', 'Disabler', 'Jungler']"
2,2,Ranged,3,4,Bane,npc_dota_hero_bane,int,"['Support', 'Disabler', 'Nuker', 'Durable']"
3,3,Melee,4,2,Bloodseeker,npc_dota_hero_bloodseeker,agi,"['Carry', 'Disabler', 'Jungler', 'Nuker', 'Ini..."
4,4,Ranged,5,2,Crystal Maiden,npc_dota_hero_crystal_maiden,int,"['Support', 'Disabler', 'Nuker', 'Jungler']"

Сгруппируйте героев из датасэта по числу их ног (колонка legs), и заполните их число в задании ниже:

In [6]:
dota2_stats.groupby('legs')['name'].count()

legs
0    11
2    95
4     7
6     3
8     1
Name: name, dtype: int64

К нам поступили данные из бухгалтерии о заработках Лупы и Пупы за разные задачи! Посмотрите у кого из них больше средний заработок в различных категориях (колонка Type) и заполните таблицу, указывая исполнителя с большим заработком в каждой из категорий.

In [7]:
accountancy = pd.read_csv('data/accountancy.csv')
accountancy.info()
accountancy.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  50 non-null     int64
 1   Executor    50 non-null     object
 2   Type        50 non-null     object
 3   Salary      50 non-null     int64
dtypes: int64(2), object(2)
memory usage: 1.7+ KB

   Unnamed: 0 Executor Type  Salary
0           0     Pupa    D      63
1           1     Pupa    A     158
2           2     Pupa    D     194
3           3     Pupa    E     109
4           4    Loopa    E     184

In [11]:
accountancy.groupby(['Type', 'Executor'])['Salary'].mean().unstack('Executor')
# еще варианта
#accountancy.pivot_table(values = "Salary", index = "Executor", columns = "Type")

Executor       Loopa        Pupa
Type
A          58.000000  160.833333
B         145.166667   77.000000
C         154.333333   74.500000
D         137.714286  146.500000
E         164.000000  131.200000
F         238.000000  136.250000